Autodesk.Revit.DB.WorksetConfigurationOption
A collection of options used to initialize a WorksetConfiguration.
Since:
2015

Autodesk.Revit.DB.WorksetConfigurationOption.OpenLastViewed
Close all user-created worksets by default, but open last viewed worksets.

Autodesk.Revit.DB.WorksetConfigurationOption.CloseAllWorksets
Close all user-created worksets by default.  Additional close requests will be ignored for this type of configuration.

Autodesk.Revit.DB.WorksetConfigurationOption.OpenAllWorksets
Open all user-created worksets by default.  Additional open requests will be ignored for this type of configuration.